-- This file needs to have same structure as nvconfig.lua
-- https://github.com/NvChad/ui/blob/v3.0/lua/nvconfig.lua
-- Please read that file to know all available options :(

---@type ChadrcConfig
local M = {}

M.base46 = {
  theme = "tokyonight",
  integrations = { "notify" },
}

M.ui = {
  statusline = {
    order = { "mode", "file", "git", "%=", "lsp_msg", "%=", "diagnostics", "custom_lsp", "cwd", "cursor" },
    modules = {
      custom_lsp = function()
        return "%#St_Lsp#" .. require("utils").stl_lsp()
      end,
    },
  },
}

M.nvdash = {
  load_on_startup = true,
  header = {
    "██████╗░░██████╗░░██████╗██╗██╗░░██╗░██████╗░██████╗░███████╗",
    "██╔══██╗██╔═══██╗██╔════╝██║██║░██╔╝██╔═══██╗██╔══██╗██╔════╝",
    "██████╔╝██║░░░██║██║░░░░░██║█████╔╝░██║░░░██║██║░░██║█████╗░░",
    "██╔═══╝░██║░░░██║██║░░░░░██║██╔═██╗░██║░░░██║██║░░██║██╔══╝░░",
    "██║░░░░░╚██████╔╝╚██████╗██║██║░░██╗╚██████╔╝██████╔╝███████╗",
    "╚═╝░░░░░░╚═════╝░░╚═════╝╚═╝╚═╝░░╚═╝░╚═════╝░╚═════╝░╚══════╝",
    "",
    "  Powered By  eovim ",
    "",
  },
}

M.lsp = { signature = false }

return M
